// --------------------------------------------------------
// File: 连续子序列的最大值问题
// Require: __cplusplus >= 201402
// --------------------------------------------------------
// Author: zbye
// --------------------------------------------------------
#include <algorithm>
#include <iostream>
#include <vector>

// --------------------------------------------------------
// 预声明

// --------------------------------------------------------
// 设定类型别名
using usize = int;
using Value = int;
using array = std::vector<Value>;

// --------------------------------------------------------
// 定义对象

// --------------------------------------------------------
// Fn: 连续子序列的最大值问题
// 题解: 队列结构
void max_subseq() {
  usize n, k;  // 元素个数 n, 片段长度 k
  std::cin >> n >> k;
  array arr(n);

  for (usize i = 0; i < n; i++) {
    std::cin >> arr[i];
  }
}

// --------------------------------------------------------
// Fn: Main
int main(int argc, char const *argv[]) {
  // std::cout << "c++ standard version: " << __cplusplus << "\n";
  max_subseq();
  return 0;
}