// --------------------------------------------------------
// File: 统计矩形问题
// Require: __cplusplus >= 201402
// --------------------------------------------------------
// Author: zbye
// --------------------------------------------------------
#include <iostream>
#include <vector>

// --------------------------------------------------------
// 预声明

// --------------------------------------------------------
// 设定类型别名
using usize = size_t;

// --------------------------------------------------------
// 定义对象

// --------------------------------------------------------
// Fn: 统计矩形问题
// 题解: 枚举思想
void rectnum() {
  usize n, m;  // n 行, m 列
  std::cin >> n >> m;

  // Lambda: 矩形个数计算公式
  auto C = [](usize x) { return (x + 1) * (x >> 1); };
  usize nrect = C(n) * C(m);

  // 计算正方形个数
  usize nsqure = 0;
  for (usize i = 1; i <= std::min(n, m); i++) {
    nsqure += (m - i + 1) * (n - i + 1);
  }

  // 长方形个数 = 矩形个数 - 正方形个数
  std::cout << nsqure << " " << (nrect - nsqure) << "\n";
}

// --------------------------------------------------------
// Fn: Main
int main(int argc, char const *argv[]) {
  rectnum();
  return 0;
}
